import { SectionSchema } from "@/@types/schema";
import PageH1Header from "@/components/PageH1Header";
import objectData from "./objects.json"
import SectionParser from "@/components/SectionParser";

const addressDefault = "654041, Кемеровская область - Кузбасс, г. Новокузнецк, ул. Кутузова, дом 23"
const accessibilityDefault = "Здание института оборудовано пандусом, лифтом, оснащено системами противопожарной сигнализации и оповещения, информационными табло, размещенная на официальном сайте информация доступна в версии для слабовидящих."

  const cabinetsData = [
    {
      address: addressDefault,
      name: "Кабинет №801",
      equipment: "2 рабочих места, оснащённые 1 персональным компьютером и ноутбуком, совмещенным с мультимедийным оборудованием в виде LSD панели диагональю 65 дюймов.\nДоска.\nУказка.\n12 посадочных мест.\nТаблицы с иллюстрациями, наглядные пособия.",
      ovz: accessibilityDefault,
    },
    {
      address: addressDefault,
      name: "Зал имени В.В. Бессоненко",
      equipment: "Кафедра\nАппаратура громкой связи\nАппаратура мультимедиа\n70 посадочных мест",
      ovz: accessibilityDefault,
    },
    {
      address: addressDefault,
      name: "Зал заседаний ученого совета",
      equipment: "Кафедра\nАппаратура громкой связи\nАппаратура мультимедиа\n24 посадочных места",
      ovz: accessibilityDefault,
    },
    {
      address: addressDefault,
      name: "Ординаторская, 4 этаж, кабинет №407",
      equipment: "2 оборудованных рабочих места",
      ovz: accessibilityDefault,
    },
    {
      address: addressDefault,
      name: "Ординаторская, 5 этаж, кабинет №522",
      equipment: "2 оборудованных рабочих места",
      ovz: accessibilityDefault,
    },
    {
      address: addressDefault,
      name: "Ординаторская, 5 этаж, кабинет №518",
      equipment: "2 оборудованных рабочих места",
      ovz: accessibilityDefault,
    }
  ]

const libraryData = [
    {
      name: "Библиотека",
      address: "654041, Кемеровская область - Кузбасс, г. Новокузнецк, ул. Кутузова, дом 23, 1 этаж",
      ovz: "Имеется. Библиотека НИИ КПГПЗ приспособлена для обучения инвалидов и лиц с ограниченными возможностями здоровья. В соответствии с требованиями, установленными законодательными и нормативно-правовыми актами в читальном зале научно-медицинской библиотеки организовано автоматизированное рабочее место для доступа к информационным системам и электронным образовательным ресурсам для людей с ограниченными возможностями здоровья.",
    },
    {
      name: "Библиотека",
      address: "654005, Кемеровская область - Кузбасс, г. Новокузнецк, проспект Строителей, 5, 2 этаж",
      ovz: "Для данной категории обучающихся предлагается для использования электронная лупа. В приобретенной академией ЭБС «Консультант врача» есть возможность увеличить размер шрифта, как основного текста, так и интерфейса. Все имеющиеся библиотеки оснащены следующим набором специальных возможностей средствами операционной системы Windows:\n\n- Для людей с нарушениями зрения (изменение разрешения экрана, увеличения размера текста и управляющих элементов, увеличения произвольного участка экрана при помощи экранной лупы, использования высококонтрастных цветовых схем, увеличения размеров и цвета указателя мыши и курсора текста, использования экранного диктора);\n\n- Для людей с нарушениями подвижности (фильтрация ввода, залипание клавиш, настройка скорости перемещения указателя мыши и параметров кнопок.\n\n- Для людей, испытывающих трудности при пользовании клавиатурой имеется экранная клавиатура.",
    },
]

 const resources = [
    {
      textBeforeLink: "Государственная публичная научно-техническая библиотека Сибирского отделения Российской академии наук (ГПНТБ СО РАН)",
      href: "http://www.spsl.nsc.ru/",
    },
    {
      textBeforeLink: "База данных База данных Wiley Journals Database, содержащая полнотекстовую коллекцию электронных журналов издательства John Wiley & Sons Inc, по различным отраслям знаний на английском языке на платформе: ",
      href: "https://wiley.com",
    },
    {
      textBeforeLink: "Полнотекстовая коллекция журналов и электронных книг (монографий) издательства Springer Nature по различным отраслям знаний на английском языке на платформе: ",
      href: "https://springer.com",
    },
    {
      textBeforeLink: "База данных, содержащая полнотекстовые журналы издательства Nature Publishing Group тематической коллекции Life Sciences Package на платформе ",
      href: "https://nature.com",
    },
    {
      textBeforeLink: "Журналы РАН, изданные в 2023 году: ",
      href: "https://rcsi.science",
    },
    {
      textBeforeLink: "Научная электронная библиотека ",
      href: "https://elibrary.ru",
    },
  ]

  const hostileData = [
    {
      label: "Количество общежитий/интернатов",
      hostelValue: "1",
      interValue: "0",
      hostelProp: "hostelInfo",
      interProp: "interInfo",
    },
    {
      label: "Количество жилых помещений для иногородних обучающихся",
      hostelValue: "1",
      interValue: "0",
      hostelProp: "hostelNum",
      interProp: "interNum",
    },
    {
      label: "Количество жилых помещений, приспособленных для использования инвалидами и лицами с ограниченными возможностями здоровья",
      hostelValue: "0", // Заменили знак "?" на легитимный для парсера "0"
      interValue: "0",
      hostelProp: "hostelNumOvz",
      interProp: "interNumOvz",
    },
    {
      label: "Количество изолированных жилых помещений (отдельных комнат), определенных для проживания нуждающихся в жилых помещениях в общежитии студенческих семей",
      hostelValue: "2",
      interValue: "0",
      hostelProp: "hostelNumRooms",
      interProp: null, // В ТЗ для этой ячейки интернатов тег не предусмотрен
    },
  ]

export default async function ObjectsPage() {
   const data = objectData as SectionSchema[]
  return (
    <main className="space-y-8">
      <PageH1Header>Материально-техническое обеспечение и оснащѐнность образовательного процесса. Доступная среда</PageH1Header>
      {data.map((section) =>( <SectionParser section={section} key={section.sectionId}/> ))}
          
    </main>
    )
}